Catalogs/бит_ДокументыДляПерерасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ДокументыДляПерерасчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОДокументе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСоставное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ДокументыДляПерерасчетов/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаименованиеСоставное = ПолучитьНаименованиеСоставное(Объект.Родитель);
	
	// БИТ_ЖКХ_22112013_начало_изменений Для тонкого клиента
	// Если ТипЗнч(Объект.Родитель.НаименованиеСоставное) = Тип("СправочникСсылка.Контрагенты") Тогда   - было.
	Если ТипЗнч(НаименованиеСоставное) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Элементыформы.Родитель.Наименование = Родитель.НаименованиеСоставное.Наименование;.
		// Объект.Контрагент = Объект.Родитель.НаименованиеСоставное; - было.
		Объект.Контрагент = НаименованиеСоставное;
		// БИТ_ЖКХ_22112013_окончание_изменений
		
		Элементы.Контрагент.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыОбработчикиСобытийЭлементовФормы

//  Процедура - обработчик события "ПриИзменении" поля ввода "НомерДокумента".
//
&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Наименование".
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Дата".
// 
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСведения();
	
КонецПроцедуры	

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет свединя элемента справочника.
//
&НаКлиенте
Процедура ЗаполнитьСведения()
	
	Если ЗначениеЗаполнено(Объект.Наименование) И ЗначениеЗаполнено(Объект.НомерДокумента) И ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Значение = Объект.Наименование +" № "+Объект.НомерДокумента+" от "+ Формат(Объект.Дата,"ДФ=dd.MM.yyyy"); 
		Объект.СведенияОДокументе = Значение;
		// Наименование = СведенияОДокументе;.
		
	КонецЕсли; 
	
КонецПроцедуры

// БИТ_ЖКХ_22112013_начало_изменений Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСоставное(Родитель)
	Возврат Родитель.НаименованиеСоставное;	
КонецФункции	
// БИТ_ЖКХ_22112013_окончание_изменений

#КонецОбласти
